PreProcessing/BaseFlowGenerator/FlatPlateModule/constant/inputParam
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      inputParam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Boundaries information
Upinlet
{
//Inflow parameters
 Uinf        12.417664315415696;    // chordwise velocity
 Winf        20.3;                  // spanwise velocity
 xInlet      0.046694057793992;     // inlet position (i.e., distance from virtual LE)
    
//Top-boundary parameters (coefficient of polinomyal, Casacuberta et al, 2022)    
 pa4         0.004709401639645;
 pa3         0.059408065736933;
 pa2         0.245222700832888;
 pa1         0.657504955493668;
 pa0         2.006271563747756;
    
//Fluid properties
 freeStreamViscosity   1.456610719354608e-5;         //[m^2s^1]

//Output settings
 outputFormat          csv;      // csv | binary
}

// ************************************************************************* //
