PreProcessing/BaseFlowGenerator/FlatPlateModule/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100000;

deltaT          1;

writeControl    timeStep;

writeInterval   #calc "$endTime / 100" ;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // 
    yPlus
    {
    type                 yPlus;
    libs                 ("libfieldFunctionObjects.so");
    executeControl       writeTime;
    writeControl         writeTime;
    }

    writeMidPlane
    {
        type            coded;
        libs            ("libutilityFunctionObjects.so");
        name            writeMidPlane;
        executeControl  writeTime;
        writeControl    none;

        codeInclude
        #{
            #include "OFstream.H"
            #include <fstream>
        #};

        codeExecute
        #{
            const fvMesh& mesh = refCast<const fvMesh>(obr_);
            const volVectorField& U =
                mesh.lookupObject<volVectorField>("U");
            const volScalarField& p =
                mesh.lookupObject<volScalarField>("p");
            const vectorField& C = mesh.C();

            // Read output format from inputParam
            IOdictionary inputParam
            (
                IOobject
                (
                    "inputParam", "constant", mesh,
                    IOobject::MUST_READ, IOobject::NO_WRITE
                )
            );
            const dictionary& d = inputParam.subDict("Upinlet");
            const word fmt = d.lookupOrDefault<word>("outputFormat", "csv");

            const scalar zTarget = 1e-5;
            const scalar zTol    = 2.5e-5;

            // Collect cells on the mid-plane
            DynamicList<label> cells;
            forAll(C, cellI)
            {
                if (mag(C[cellI].z() - zTarget) < zTol)
                {
                    cells.append(cellI);
                }
            }

            const fileName outDir =
                mesh.time().globalPath()/"postProcessing";
            mkDir(outDir);

            if (fmt == "binary")
            {
                const fileName fpath = outDir/"midPlane.bin";
                std::ofstream ofs(fpath, std::ios::binary);

                // Header: 7 columns, number of rows
                int32_t nCols = 7;
                int64_t nRows = cells.size();
                ofs.write(reinterpret_cast<const char*>(&nCols), sizeof(nCols));
                ofs.write(reinterpret_cast<const char*>(&nRows), sizeof(nRows));

                // Data: x,y,z,u,v,w,p as doubles per row
                forAll(cells, i)
                {
                    const label ci = cells[i];
                    double row[7] =
                    {
                        C[ci].x(), C[ci].y(), C[ci].z(),
                        U[ci].x(), U[ci].y(), U[ci].z(),
                        p[ci]
                    };
                    ofs.write(reinterpret_cast<const char*>(row), sizeof(row));
                }

                Info<< "writeMidPlane: wrote " << nRows
                    << " cells (binary) to " << fpath << endl;
            }
            else
            {
                OFstream os(outDir/"midPlane.csv");
                os.precision(10);
                os << "x,y,z,u,v,w,p" << nl;

                forAll(cells, i)
                {
                    const label ci = cells[i];
                    os  << C[ci].x() << ","
                        << C[ci].y() << ","
                        << C[ci].z() << ","
                        << U[ci].x() << ","
                        << U[ci].y() << ","
                        << U[ci].z() << ","
                        << p[ci] << nl;
                }

                Info<< "writeMidPlane: wrote " << cells.size()
                    << " cells (csv) to " << os.name() << endl;
            }
        #};
    }
}


// ************************************************************************* //
